ACCOUNTS = [
    {'key': 'Viper373',  # 用户唯一标识
     'username': '18719751217',
     'password': 'ShadowZed666',
     'station': [['北京', '西安'], ['西安', '庆阳'], ],
     'date': [['2024-04-28', '2024-04-29', '2024-04-30'], ['2024-05-04', '2024-05-05', '2024-05-06'], ],
     'ticket_type': ['普通票', '学生票'],
     'train_type': ['GC', 'D'],  # GC-高铁/城际 D-动车 Z-直达 T-特快 K-快速 O-其他 F-复兴号 AI-智能动车组
     'seat_type': ['一等座', '二等座'],  # 商务座/特等座 一等座 二等座/二等包座 高级软卧 软卧/一等卧 动卧 硬卧/二等卧 软座 硬座 无座 其他
     'position': ['D', 'E']  # A B C D E F
     },
    # {'username': '18719751217',
    #  'password': 'ShadowZed666',
    #  'station': [['北京', '西安'], [], [], []],
    #  'date': ['2024-04-28', '2024-04-29', '2024-04-30',],
    #  'ticket_type': ['普通票', '学生票'],
    #  'train_type': ['GC', 'D'],  # GC-高铁/城际 D-动车 Z-直达 T-特快 K-快速 O-其他 F-复兴号 AI-智能动车组
    #  'seat_type': 'your_seat_type',  # 商务座/特等座 一等座 二等座/二等包座 高级软卧 软卧/一等卧 动卧 硬卧/二等卧 软座 硬座 无座 其他
    #  'position': 'your_position'},  # A B C D E F
]
